app/controllers/sessions_controller.rb

SELECT  `omniauthusers`.* FROM `omniauthusers` WHERE `omniauthusers`.`provider` = 'facebook' AND `omniauthusers`.`uid` = '10155405662215374'  ORDER BY `omniauthusers`.`id` ASC LIMIT 1
---
  def facebookcreate
    auth = request.env["omniauth.auth"]
    omniauthuser = Omniauthuser.find_by_provider_and_uid(auth["provider"], auth["uid"]) #|| Omniauthuser.create_with_omniauth(auth)